import { ScrollView, StyleSheet, Text, View } from "react-native";
import React from "react";

const TermsPolicy = () => {
  return (
    <ScrollView
      style={{ marginHorizontal: 10, backgroundColor: "white" }}
      showsVerticalScrollIndicator={false}
    >
      <Text style={{ fontWeight: "bold", textAlign: "center", fontSize: 18 }}>
        ihelp.mn платформын хэрэглэгчдэд зориулсан үйлчилгээний нөхцөл
      </Text>
      <Text style={{ fontSize: 14, fontWeight: "bold", marginVertical: 10 }}>
        Хамгийн сүүлд шинэчилсэн огноо: 2022/10/24
      </Text>
      <Text style={styles.terms}>
        Энэхүү үйлчилгээний нөхцөл нь “ihelp.mn” платформд хэрэглэгчээр
        бүртгүүлэх, уг платформд байршуулж буй “үйлчилгээ”-г хүлээн авахтай
        холбоотой талуудын эрх, үүрэг, оролцоог тодорхойлоход оршино.
      </Text>
      {/* 1 */}
      <>
        <Text style={styles.title}>НЭГ. НИЙТЛЭГ ҮНДЭСЛЭЛ</Text>
        <Text style={styles.terms1}>
          1.1 “ihelp.mn” нь “Новелист” ХХК-ийн албан ёсны өмч бөгөөд албан
          байгууллага болон хувь хүний хэрэгцээ шаардлагад үүссэн үйлчилгээг
          ажлын зарын тусламжтайгаар холбож өгөх үүрэгтэй платформ юм.{" "}
        </Text>
        <Text style={styles.terms1}>
          1.2 “ihelp.mn” (цаашид “ Гүйцэтгэгч” гэнэ ) –н хамтран ажиллах
          үйлчилгээний нөхцөл болно.
        </Text>
        <Text style={styles.terms1}>
          1.3 Энэхүү нөхцөл нь Харилцагч байгууллага болон хувь хүн (цаашид
          “Хэрэглэгч” гэнэ) зар нийтлэх эрх авахаас өмнө хүлээн зөвшөөрч
          баталгаажуулсны үндсэн дээр хэрэгжинэ.
        </Text>
        <Text style={styles.terms1}>
          1.4 Энэхүү үйлчилгээний нөхцөл нь Захиалагч тал хүлээн зөвшөөрч,
          ihelp.mn-д бүртгүүлсэн өдрөөс хүчин төгөлдөр үйлчилнэ.{" "}
        </Text>
      </>
      {/* 2 */}
      <>
        <Text style={styles.title}>
          ХОЁР. ГҮЙЦЭТГЭГЧИЙН ЭРХ, ҮҮРЭГ, ХҮЛЭЭХ ХАРИУЦЛАГА
        </Text>
        <Text style={styles.terms1}>
          2.1 Гүйцэтгэгч тал нь өөрийн “www.ihelp.mn” сайт болон аппликэйшнээрээ
          дамжуулан Хэрэглэгчийн ажлын байрны зар болон бусад мэдээ, мэдээллийг
          байршуулан хүргэх ажлыг мэргэжлийн өндөр төвшинд, алдаа, доголдолгүй
          хийж гүйцэтгэнэ.
        </Text>
        <Text style={styles.terms1}>
          2.2 Гүйцэтгэгч нь вэб портал сайт, аппликэйшны аюулгүй, тогтвортой
          ажиллагааг хангаж Хэрэглэгч цаашид зар, мэдээлэл оруулах боломжийг
          бүрдүүлж өгнө. /Жич: Тухайн зар, мэдээллийг Хэрэглэгч өөрөө оруулан
          засварлах, өөрчлөх, бүрэн боломжтой байх ба шаардлагатай тохиолдолд
          Хэрэглэгчийн оруулж буй мэдээллийн утга агуулга, дизайны тал дээр
          Гүйцэтгэгч тал санал, зөвлөгөө өгч болно./
        </Text>
        <Text style={styles.terms1}>
          2.3 Гүйцэтгэгч нь Хэрэглэгч талд системд нэвтрэн орж зар, мэдээлэл
          оруулах, засварлах, устгах эрх бүхий нэвтрэх нэр, нууц үгийг олгох
          бөгөөд нууц үгээ алдсанаас болж үүсэх бусад асуудлыг Гүйцэтгэгч
          хариуцахгүй болно.
        </Text>
        <Text style={styles.terms1}>
          2.4 Гүйцэтгэгч нь вэб портал сайт, платформынхаа өдөр тутмын аюулгүй
          байдлыг ханган ажиллаж Хэрэглэгчийн мэдээллийг гаднын халдлагаас
          сэргийлэн ажиллана.
        </Text>
        <Text style={styles.terms1}>
          2.5 Гүйцэтгэгч тал нь сайтыг шинэчлэх, засварлах тохиолдолд
          Хэрэглэгчийн өмнө оруулсан зар, мэдээ мэдээллийг хэвээр байршуулах
          үүрэгтэй бөгөөд сайтын бүтэц зохион байгуулалт өөрчлөгдөх тохиолдолд
          тухайн өөрчлөлтийн талаарх мэдээлэл болон ашиглалтын талаарх
          шаардлагатай заавар зааварчилгааг Хэрэглэгчид тухай бүр өгөх үүрэгтэй.
        </Text>
        <Text style={styles.terms1}>
          2.6 Хэрэв 3.2, 3.3 заалтыг Хэрэглэгч биелүүлээгүй тохиолдолд
          Гүйцэтгэгч тал тухайн ажлын зарыг нийтлэхгүй байх эрхтэй.
        </Text>
      </>
      {/* 3 */}
      <>
        <Text style={styles.title}>
          ГУРАВ. ХЭРЭГЛЭГЧИЙН ЭРХ, ҮҮРЭГ, ХҮЛЭЭХ ХАРИУЦЛАГА
        </Text>
        <Text style={styles.terms1}>
          3.1 Хэрэглэгч нь 16-аас доошгүй настай байх ба Хуулийн хүрээнд гэрээ
          байгуулах чадамжтай, эрх зүйн хариуцлагаа ойлгосон иргэн байна.
        </Text>
        <Text style={styles.terms1}>
          3.2 Хэрэглэгч талын сурталчилгаа болон зар, мэдээ, нийтлэл нь Монгол
          Улсын зар сурталчилгааны тухай болон бусад хууль тогтоомжоор
          хориглосон бараа бүтээгдэхүүн, үйлчилгээг сурталчлаагүй байна.
        </Text>
        <Text style={styles.terms1}>
          3.3 Хэрэглэгч нь тухайн гишүүнчлэлийн эрхийн хүрээнд групп компанийн
          бусад охин компаниудын ажлын зарыг оруулахгүй байх үүрэгтэй.
        </Text>
        <Text style={styles.terms1}>
          3.4 Хэрэглэгч тал нь анкет хүлээн авахдаа Гүйцэтгэгч талын анкет
          загварыг ашиглана.
        </Text>
        <Text style={styles.terms1}>
          3.5 Ажил хайгчийн анкет бүртгэл, мэдээллийг ажлын хэрэгцээнээс бусад
          зорилгоор ашиглахгүй байх үүрэгтэй.
        </Text>
        <Text style={styles.terms1}>
          3.6 Зарын талбаруудыг зориулалтын дагуу бөглөх үүрэгтэй.
        </Text>
        <Text style={styles.terms1}>
          3.7 Өөрийн платформд нэвтрэх хаяг, хувийн мэдээлэл болон нууц үгийг
          чандлан хадгалах, бусдад дамжуулахгүй байх үүрэгтэй.
        </Text>
        <Text style={styles.terms1}>
          3.8 Хэрэглэгч нь зарласан ажлын байрны зар, реклам сурталчилгаа,
          мэдээллийн үнэн бодит байдлыг хариуцна.
        </Text>
      </>
      {/* 4 */}
      <>
        <Text style={styles.title}>ДӨРӨВ. ТӨЛБӨР ТООЦОО</Text>
        <Text style={styles.terms1}>
          4.1 Хэрэглэгч нь аливаа зар, мэдээллийг оруулахын өмнө өөрийн
          хэрэгцээнд үндэслэн тохирох мөнгөн дүнгээр хэтэвчээ цэнэглэсэн байх
          шаардлагатай бөгөөд төлбөрт үйлчилгээг сайтаас болон аппликэйшнээр
          дамжуулан авах боломжтой.
        </Text>
        <Text style={styles.terms1}>
          4.2 Хэрэглэгч нь төлбөрт үйлчилгээг ашиглахаас өмнө Төлбөрийн
          нөхцөлтэй анхлан танилцах үүрэгтэй.{" "}
        </Text>
      </>
      {/* 5 */}
      <>
        <Text style={styles.title}>ТАВ. БУСАД ЗҮЙЛ</Text>
        <Text style={styles.terms1}>
          5.1 Аль нэг талын гэм буруугаас гишүүнчлэлийг цуцлах, үйлчилгээний
          нөхцөлтэй холбоотой талуудын хооронд үүсэх аливаа маргаантай асуудлыг
          талууд харилцан зөвшилцөх замаар шийдвэрлэнэ. Зөвшилцөлд хүрээгүй
          тохиолдолд шүүхээр шийдвэрлүүлнэ.
        </Text>
      </>
    </ScrollView>
  );
};

export default TermsPolicy;

const styles = StyleSheet.create({
  terms: { fontWeight: "300", fontSize: 12 },
  terms1: {
    fontWeight: "300",
    fontSize: 12,
    marginHorizontal: 10,
    marginTop: 5,
  },
  title: { fontSize: 18, fontWeight: "bold", marginTop: 10, marginBottom: 5 },
});
